Revit 2026 API

# View3DCanToggleBetweenPerspectiveAndIsometric Method

---

Checks whether this view can toggle between perspective and isometric.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanToggleBetweenPerspectiveAndIsometric()
```
```vb
Public Function CanToggleBetweenPerspectiveAndIsometric As Boolean
```
```cpp
public:
bool CanToggleBetweenPerspectiveAndIsometric()
```
```fsharp
member CanToggleBetweenPerspectiveAndIsometric : unit -> bool
```

#### Return Value

Boolean True if this view can be toggled, false otherwise.

This view can only be toggled if no view specific elements are contained.

#### Reference

View3D Class

Autodesk.Revit.DB Namespace